{
  "agent-browser-mcp": "Automate a real browser for web testing: navigate, snapshot the DOM/accessibility tree, click/fill/type, scroll, take screenshots/PDFs, and manage cookies/sessions.",
  "aws-ec2-windows": "Manage a Windows EC2 instance: check status/IP, start/stop (including emergency stop), fetch the Administrator password and RDP details, and inspect protection logs.",
  "better-auth": "Generate Better Auth setup for your app: create server/client config files, list required env vars, and enable features like social login, 2FA, passkeys, and database adapters.",
  "context7": "Fetch up-to-date library/framework documentation: resolve library IDs, query API references, and pull authoritative code examples for correct usage.",
  "discord-py-self": "Control a Discord user account: read/send messages, manage channels/threads/roles, react to messages, and interact with buttons/menus and slash commands.",
  "font-mcp": "Pick and configure fonts: recommend pairings by vibe, analyze a website to identify fonts, and generate Tailwind/CSS setup code.",
  "grep-app": "Search local files quickly: intent-based search, regex search, count matches, and list files containing matches.",
  "gsap": "Design GSAP animations and patterns: generate timelines/ScrollTrigger setups, debug animation bugs, optimize for performance, and produce production-ready sequences.",
  "kagi-search": "Run Kagi web searches: query with operators, return structured results (title/link/snippet), and gather multiple sources for verification.",
  "mintlify": "Fetch documentation content from Mintlify via a remote integration (disabled by default).",
  "motion": "Generate CSS easing helpers: create spring-like and bounce-like linear() transitions tuned by duration/bounce for UI animation.",
  "n8n-mcp": "Work with n8n programmatically: search nodes/templates, validate node/workflow configs, create/update workflows, and inspect executions.",
  "next-devtools": "Inspect and debug a running Next.js dev server: discover available routes/tools, fetch compile/runtime errors, and run browser-based checks when needed.",
  "perplexity-webui": "Do web research with sources: run quick lookups or deep research and return cited answers from the internet.",
  "qmd": "Index and search a Markdown knowledge base: keyword search, semantic vector search, hybrid query with reranking, and retrieve full documents.",
  "reactbits": "Browse React Bits UI snippets: list/search components, fetch component source code, and get demo usage examples.",
  "registry-directory-mcp": "Discover UI component registries and blocks: search registries/components by keyword and fetch full component details/JSON when available.",
  "ssh-ec2-tailscale": "Run remote shell commands over SSH to an EC2 host reachable via Tailscale: exec commands, use sudo, and fetch diagnostics for ops workflows.",
  "ssh-local-dev": "Run remote shell commands over SSH to a local dev host: exec commands, use sudo, and fetch diagnostics for development workflows.",
  "ssh-nas": "Run remote shell commands over SSH on a NAS host: exec commands, use sudo, and fetch diagnostics for ops workflows.",
  "ssh-oracle": "Run remote shell commands over SSH on an Oracle host: exec commands, use sudo, and fetch diagnostics for ops workflows.",
  "ssh-usa": "Run remote shell commands over SSH on a USA host: exec commands, use sudo, and fetch diagnostics for ops workflows.",
  "stitch": "Generate and edit UI screens: create screens from text prompts, edit existing screens, and generate design variants (layout/color/typography/content).",
  "supabase": "Work with Supabase/Postgres: manage projects and run database-related operations.",
  "vercel": "Manage Vercel projects and deployments: list teams/projects/deployments, fetch build/runtime logs, create share links for protected previews, and deploy from this repo."
}
